In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as snsh

In [2]:
pd.set_option("display.max_columns",None)
pd.set_option("display.max_rows",100)

# basic imports and formating

1) set_option() prevents columns and rows from hiding

In [3]:
df = pd.read_csv("titanic.csv")

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
df.sample(5,random_state = 42)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
709,710,1,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C
439,440,0,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S
840,841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S
720,721,1,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C

In [8]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
df.shape

(891, 12)

# data set overview
1) one represents one passeneger 
2) this data set is about predicting survived or not survived
3) classification type of problem
4) taget variable is 'Survived' column

# basic data overview

1) df.head() first five rows it gives by default and can also specify the rows
2) df.tail() gives the last five rows by default 
3) df.sample() randomly selectes the data from entire data set we can specify the rows here
4) random_state is local and gives the same random number repeats same random sequence eachtime
5) shape gives rows and column count
6) df.colums gives the column names

# data types over view

In [10]:
df.info(memory_usage=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)

In [11]:
df.dtypes.value_counts() # it only understands storage

object     5
int64      5
float64    2
dtype: int64

# semantic Data types
1) numerical data 
   - continous and discrete
2) categorical data
   - nominal(no order)
   - nominal(with order)
3) text data
   - example name,reviews,description,comment etc
4) datae and time data 
5) identifiers
   - primary keys

# cardinality and uniqueness
its about checking unique values usefull for feature engineering less than 10 to 15 is 
acceptable

In [12]:
df.nunique().sort_values(ascending=False)

Name           891
PassengerId    891
Ticket         681
Fare           248
Cabin          147
Age             88
Parch            7
SibSp            7
Embarked         3
Pclass           3
Sex              2
Survived         2
dtype: int64

# detecting 
# 1. missing values 
# 2. duplicate values

In [13]:
df.isna().sum()/df.shape[0]*100 # gets percentage of individaul column missing values

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [14]:
(df.isna().sum().sum())/(df.shape[0]*df.shape[1])*100 # gives total missing

8.099513655069211

In [15]:
(df.isna().mean()*100).round(2) # another friendly way

PassengerId     0.00
Survived        0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            19.87
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.00
Cabin          77.10
Embarked        0.22
dtype: float64

In [16]:
df.duplicated().sum()

0

# conclusion on data quality by using duplicate value counts
1) check duplicate rows its misleading in ml models
2) check for inconsistent data like m or M in gender like that for any column 
   use .unique()
3) check for impossible values based on scope and domain